# pandas

- powerful tool for data analysis and manipulation 
- built on top of numpy (makes it very fast and efficient)
- have 2 main data structures : pandas series and pandas dataframe

# pandas series

## creating pandas series 
- using `pd.Series(data, indicies)`
- it's a 1D array-like object that can hold many data types
 - this is different than a numpy array that could hold only 1 Datatype 
 - another difference is that we can assign index label to each element in the pandas series (we have labels as indices in here)

In [1]:
import pandas as pd

In [2]:
groceries = pd.Series(data=[30 ,6 ,"yes" ,"no"], index = ["eggs","apples","milk","bread"])
groceries

eggs       30
apples      6
milk      yes
bread      no
dtype: object

the series is displayed with the indicies (that we assigned) and the values (of different types)

## attributes of information in the data series

In [3]:
groceries.shape # Gives us the sizes of each dimension of the data (here we have 1D with 4 elements)

(4,)

In [4]:
groceries.ndim # Gives us the number of dimensions in the data, it is 1D

1

In [5]:
groceries.size #Gives us the total number of values in the data series

4

### print the index label separately

In [6]:
groceries.index # If we recieved a new data in this structure and we don't know what the labels are b

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

### print the values separately

In [7]:
groceries.values

array([30, 6, 'yes', 'no'], dtype=object)

## dataseries supports in operator for the labels

In [8]:
# To check wither a certain index is among the indicies for a large data series 
"bananas" in groceries

False

In [9]:
"eggs" in groceries

True

## access the elements of a data series 
1. accessing elements using index labels
- we can do that using `series['label']` 
2. using numeric indicies (similar to accessing elements in numpy arrays)
- we can do that using `series[idx]`

1. accessing elements using index labels

In [10]:
groceries["eggs"]

30

provide a list of index labels to get multiple elements

In [11]:
groceries[["eggs","milk"]]

eggs     30
milk    yes
dtype: object

2. using numeric indicies

In [12]:
groceries[0]

C:\Users\TOSHIBA\AppData\Local\Temp\ipykernel_10500\71887072.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  groceries[0]

30

In [13]:
groceries[-1]

C:\Users\TOSHIBA\AppData\Local\Temp\ipykernel_10500\2373390433.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  groceries[-1]

'no'

use a list of numerical indicies to get multiple elements

In [14]:
groceries[[0,2]]

C:\Users\TOSHIBA\AppData\Local\Temp\ipykernel_10500\2448839165.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  groceries[[0,2]]

eggs     30
milk    yes
dtype: object

## important!
- what if our named labels were also integers? if there is a label that is integer, then when we use series[integer], pd will not know if we mean integer index or the integer label
    - and therefore, if there is any label that is integer, series[idx] won't work and we have to use series.loc[idx] to specify that we are using the index
- to remove any ambiguity from rather we refer to index label or numerical index, we use loc[ ] and iloc[ ]
- loc[ ] -for location- we use it to explicitly state that we want a labelled index, even if it's an integer it will understand that
- iloc[ ] -for integer location- we use it to explicity state that we are using numerical index

In [15]:
groceries.loc[["eggs","milk"]]

eggs     30
milk    yes
dtype: object

In [16]:
groceries.iloc[[0,2]]

eggs     30
milk    yes
dtype: object

## change values of a data series 
- pandas data series are mutable -just like numpy arrays- so we can change the elements of a series after it has been created

In [17]:
groceries

eggs       30
apples      6
milk      yes
bread      no
dtype: object

In [18]:
groceries["eggs"] = 2
groceries

eggs        2
apples      6
milk      yes
bread      no
dtype: object

## delete items in a data series
- using `.drop(given label or index)` method
- but drops it out of place (gives us a copy with the item deleted)
    - to drop it in place, either assign it back to the variable or set the `inplace` argument to `true` (was not there in numpy)

In [19]:
groceries.drop("apples")

eggs       2
milk     yes
bread     no
dtype: object

In [20]:
groceries

eggs        2
apples      6
milk      yes
bread      no
dtype: object

In [21]:
groceries = groceries.drop("apples")
groceries

eggs       2
milk     yes
bread     no
dtype: object

In [22]:
# or instead you can use this 
groceries.drop("bread", inplace=True)
groceries

eggs      2
milk    yes
dtype: object

## Additional Reading - Pandas Series Documentation

Refer to the list of available functions in the following two sections:

- Reindexing / selection / label manipulation
https://pandas.pydata.org/pandas-docs/stable/reference/series.html#reindexing-selection-label-manipulation
- Indexing and iteration
https://pandas.pydata.org/pandas-docs/stable/reference/series.html#indexing-iteration

## arithmetic operations on pandas series
- perform element wise arithmetic operations (like numpy arrays)

## arithmetic operations between pandas series and single numbers

In [23]:
fruits = pd.Series(data=[10,6,3], index=["apples","oranges","bananas"] )
fruits

apples     10
oranges     6
bananas     3
dtype: int64

### element wise operations
- the result will be a new series with the operation applied to each element in the series, we can re-assign it to the original series

In [24]:
fruits + 2

apples     12
oranges     8
bananas     5
dtype: int64

In [25]:
fruits - 2

apples     8
oranges    4
bananas    1
dtype: int64

In [26]:
fruits * 2

apples     20
oranges    12
bananas     6
dtype: int64

In [27]:
fruits/2

apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

## apply mathematical functions from numpy on the dataSeries

In [28]:
fruits = pd.Series(data=[10,6,3], index=["apples","oranges","bananas"] )
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [29]:
import numpy as np

In [30]:
np.sqrt(fruits)

apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [31]:
np.exp(fruits)

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [32]:
np.power(fruits,2)

apples     100
oranges     36
bananas      9
dtype: int64

## apply arithmetic operations on selected items 
- we can select items using indices or labels -as we have studied above- and apply the operation on them

In [33]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [34]:
fruits["bananas"] + 2

5

In [35]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [36]:
# we can re-assing it to be in place
fruits["bananas"] += 2

In [37]:
fruits

apples     10
oranges     6
bananas     5
dtype: int64

In [38]:
fruits.iloc[0] - 2

8

In [39]:
fruits.loc[["apples","oranges"]] * 2

apples     20
oranges    12
dtype: int64

## apply arithmetic operations on mixed data types
- we can apply arithmetic operations on mixed data types, as long as that each datatype supports the operation

In [40]:
groceries = pd.Series(data=[30,6,"yes","no"], index = ["eggs","apples","milk","bread"])
groceries

eggs       30
apples      6
milk      yes
bread      no
dtype: object

In [41]:
groceries * 2

eggs          60
apples        12
milk      yesyes
bread       nono
dtype: object

In [42]:
try:
    groceries + 2
except Exception as e:
    print(e)

can only concatenate str (not "int") to str

In [43]:
try:
    groceries/2
except Exception as e:
    print(e)

unsupported operand type(s) for /: 'str' and 'int'

- the above exceptions happened because the operations are not supported for strings

## Additional Reading - Pandas Series Documentation

Refer to the Series documentation to have a quick glance at the different attributes of Series, and the optional arguments of the constructor.
https://pandas.pydata.org/pandas-docs/stable/reference/series.html

Example

In [44]:
import pandas as pd

# DO NOT CHANGE THE VARIABLE NAMES

# Given a list representing a few planets
planets = ['Earth', 'Saturn', 'Venus', 'Mars', 'Jupiter']

# Given another list representing the distance of each of these planets from the Sun
# The distance from the Sun is in units of 10^6 km
distance_from_sun = [149.6, 1433.5, 108.2, 227.9, 778.6]


# TO DO: Create a Pandas Series "dist_planets" using the lists above, representing the distance of the planet from the Sun.
# Use the `distance_from_sun` as your data, and `planets` as your index.
dist_planets = pd.Series(data=distance_from_sun,index=planets)


# TO DO: Calculate the time (minutes) it takes light from the Sun to reach each planet. 
# You can do this by dividing each planet's distance from the Sun by the speed of light.
# Use the speed of light, c = 18, since light travels 18 x 10^6 km/minute.

# method 1 time_light = [dist_planets[planet]/18 for planet in planets]
# method 2 time_light = dist_planets.loc[planets] / 18
time_light = dist_planets / 18
print(time_light)
# TO DO: Use Boolean indexing to select only those planets for which sunlight takes less
# than 40 minutes to reach them.
# We'll check your work by printing out these close planets.
close_planets = time_light[time_light < 40]
print(close_planets)
close_planets.index

Earth       8.311111
Saturn     79.638889
Venus       6.011111
Mars       12.661111
Jupiter    43.255556
dtype: float64
Earth     8.311111
Venus     6.011111
Mars     12.661111
dtype: float64

Index(['Earth', 'Venus', 'Mars'], dtype='object')

##### notice that we could use boolean indexing with pandas data series as we did with  numpy!!!!

# pandas Data frame
- the second main data structure in pandas
- it is a 2D object with labelled rows and columns 
- can also hold multiple data types
- it is like a really powerful excil spreadsheet
- mine: it is like the 2D of the data series

## create pandas data frame 
- manually 
- by loading data from a file

### creating dataframes manually

- from a dictionary containing several pandas series 
     - using pd.DataFrame(dictionary)
     - the dictionary keys will be the columns, and the dictionary values are the dataseries themselves
         - it will apply union on the dataseries labels to be the rows labels, and use Nans for the labels that are missing from any series of them
- from a dictionary containing lists or arrays
- from a list of dictionaries

### 1. dictionary of dataSeries

In [45]:
# a dictionary containing shopping carts of 2 people
# the key is the person's name and the value is a pandas series
# the series labels are the product names and the values are the price of each product
items = {"Bob":pd.Series(data = [245,25,55],index = ["bike",'pants','watch']),
         'Alice':pd.Series(data=[40,110,500,45],index=['book','glasses',"bike",'pants'])}
items

{'Bob': bike     245
 pants     25
 watch     55
 dtype: int64,
 'Alice': book        40
 glasses    110
 bike       500
 pants       45
 dtype: int64}

In [46]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

### Notes
- dataframes are displayed in tabular form with the labels of the rows and columns in Bold
- the row labels are built from the union of the index labels of all the series 
- the column labels are built from the keys of the dictionary 
- the NAN values that appeared (stands for not a number)
 - for example Alice doesn't have a value for the index "watch"
- we have to remove these Nan values before feeding the data into a machine learning algorithm

- if we didn't define indicies for the pandas series, pandas will use numerical row indicies
    - and in union they will be alligned in order

In [47]:
items = {"Bob":pd.Series(data = [245,25,55]),
         'Alice':pd.Series(data=[40,110,500,45])}
items

{'Bob': 0    245
 1     25
 2     55
 dtype: int64,
 'Alice': 0     40
 1    110
 2    500
 3     45
 dtype: int64}

In [48]:
shopping_carts = pd.DataFrame(items)
shopping_carts

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

#### creating a data frame with a subset of the dictionary
- if we don't want all the dictionary's items and we want only subset of them 
    - we pass the keys of these items -dataseries- to the parameter `columns`
    - we pass the desired labels to the parameter `index` if we want the dataSeries but don't want the whole labels inside it 
- using DataFrame() attributes column and index

In [49]:
# a dictionary containing shopping carts of 2 people
# the key is the person's name and the value is a pandas series
# the series labels are the product names and the values are the price of each product
items = {"Bob":pd.Series(data = [245,25,55],index = ["bike",'pants','watch']),
         'Alice':pd.Series(data=[40,110,500,45],index=['book','glasses',"bike",'pants'])}
items

{'Bob': bike     245
 pants     25
 watch     55
 dtype: int64,
 'Alice': book        40
 glasses    110
 bike       500
 pants       45
 dtype: int64}

In [50]:
bob_shopping_cart = pd.DataFrame(items, columns = ["Bob"] )
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

- specifying a certain key of the dictionary -column- in `columns` attribute

In [51]:
sel_shopping_cart = pd.DataFrame(items, index=["bike",'pants'])
sel_shopping_cart

       Bob  Alice
bike   245    500
pants   25     45

- specifying a certain label of the dataSeries -rows- in `index` attribute

In [52]:
sel_shopping_cart_alice = pd.DataFrame(items, columns=["Alice"], index=['bike','pants'])
sel_shopping_cart_alice

       Alice
bike     500
pants     45

- combining the two previous points

## 2. create dataframes from dictionary of lists or arrays
- we can also create data frames from a dictionary of lists or arrays (instead of dictionary of dataSeries)
- but the lists and arrays must have the same length
- the keys of the dictionary will be the columns of the data frame as before
- the values of the dictionary will be the rows of the data frame, and the rows indices will be numerical by default (same as pandas series if we didn't define the labels)
    - but unlike the pandas series with no labels, they didn't have to have the same length like in here

In [53]:
numbers = {'integers':[1,2,3],
          'floats':[1.5,2.5,3.5]}
numbers_dataframe = pd.DataFrame(numbers)
numbers_dataframe

   integers  floats
0         1     1.5
1         2     2.5
2         3     3.5

- since the lists doesn't have labelled indicies, the data framed index column is created numerically 
- but we can still insert them as well using the `index` attribute

In [54]:
numbers_dataframe = pd.DataFrame(numbers, index=["label1","label2","label3"])
numbers_dataframe

        integers  floats
label1         1     1.5
label2         2     2.5
label3         3     3.5

## create a dataframe from a list of dictionaries 
- each item in the list will be a row, and the keys of the dictionaries will be the columns
- the columns of the dataframe will be the union of the keys of all the dictionaries in the list
- the rows will be numerical by default, but we can pass the `index` attribute to `pd.DataFrame()`

In [55]:
items = [{"bikes":10,"watches":50,"pants":30},
         {"watches":60,"glasses":10,"bikes":15,"pants":7}]
items_dataframe = pd.DataFrame(items,index=["store 1","store 2"])
items_dataframe

         bikes  watches  pants  glasses
store 1     10       50     30      NaN
store 2     15       60      7     10.0

## attributes of information in the data frame

In [56]:
items = {"Bob":pd.Series(data = [245,25,55],index = ["bike",'pants','watch']),
         'Alice':pd.Series(data=[40,110,500,45],index=['book','glasses',"bike",'pants'])}
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

### get index labels (row labels)
- rows labels are mainly an identifier in real life for the data rows

In [57]:
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

### get column labels

In [58]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

### get the data

In [59]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

### information about the shape

In [60]:
shopping_carts.shape #5 rows and 2 columns

(5, 2)

In [61]:
shopping_carts.ndim # The data is 2D

2

In [62]:
shopping_carts.size # The total elements in the data

10

### Additional Reading - Pandas Documentation
- Check out the Intro to data structures documentation for an overview of both of the key pandas data structures - Series and DataFrames.
https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html#intro-to-data-structures

- Check out the Attributes and underlying data section in the DataFrame documentation.
https://pandas.pydata.org/pandas-docs/stable/reference/frame.html#dataframe

## accessing elements in pandas data frames
- using row and column labels we can access
    - rows
    - columns 
    - individual elements

In [63]:
items = [{"bikes":10,"watches":50,"pants":30},
         {"watches":60,"glasses":10,"bikes":15,"pants":7}]
store_items = pd.DataFrame(items,index=["store 1","store 2"])
store_items

         bikes  watches  pants  glasses
store 1     10       50     30      NaN
store 2     15       60      7     10.0

access columns using the column label `df['column label']`

In [64]:
store_items[["bikes"]]

         bikes
store 1     10
store 2     15

In [65]:
store_items[["bikes","pants"]]

         bikes  pants
store 1     10     30
store 2     15      7

access rows using the row label `df.loc['row label']` or `df.iloc[row index]`

In [66]:
store_items.loc[["store 1"]]

         bikes  watches  pants  glasses
store 1     10       50     30      NaN

In [67]:
store_items.iloc[0]

bikes      10.0
watches    50.0
pants      30.0
glasses     NaN
Name: store 1, dtype: float64

access individual element either by selecting the column first then the row or the row then the column 
- `df['column label']['row label']` 
- `df.loc['row label']['column label']` or `df.iloc[row index][column index]`

In [68]:
store_items['bikes']['store 1']

10

In [69]:
try:
    store_items['store 1']["bikes"]
except Exception as e:
    print(f"Key Error: {e}")

Key Error: 'store 1'

- but we can access an entire row first -using either loc or iloc- then access the column

In [70]:
store_items.loc['store 1']["bikes"]

10.0

In [71]:
store_items.iloc[0]["bikes"]

10.0

## modify data frames (adding rows or columns)

##### add a column using `df['new column label'] = new data series or list or array`

In [72]:
store_items['shirts'] = [22,22]
store_items

         bikes  watches  pants  glasses  shirts
store 1     10       50     30      NaN      22
store 2     15       60      7     10.0      22

##### add a column using arithmetic operations on another columns

In [73]:
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  watches  pants  glasses  shirts  suits
store 1     10       50     30      NaN      22     52
store 2     15       60      7     10.0      22     29

## add a new column in a certain place
- instead of adding it at the end, we can add it in a certain place 
- using `.insert(location, column label, data)`

In [76]:
store_items

         bikes  watches  pants  glasses  shirts
store 1     10       50     30      NaN      22
store 2     15       60      7     10.0      22

In [77]:
store_items.insert(3, 'shoes',[13,22])
store_items

         bikes  watches  pants  shoes  glasses  shirts
store 1     10       50     30     13      NaN      22
store 2     15       60      7     22     10.0      22

### add a new row 
- first create a new data frame with the new rows then append it

In [78]:
new_items = [{"bikes":11,"watches":11,'pants':11,'glasses':11,'shirts':11,'suits':11}]
new_store = pd.DataFrame(new_items,index=["store 3"])
new_store

         bikes  watches  pants  glasses  shirts  suits
store 3     11       11     11       11      11     11

In [79]:
store_items

         bikes  watches  pants  shoes  glasses  shirts
store 1     10       50     30     13      NaN      22
store 2     15       60      7     22     10.0      22

In [80]:
store_items.append(new_store)

AttributeError: 'DataFrame' object has no attribute 'append'

- future note: the above cell used to work

In [81]:
store_items = pd.concat([store_items,new_store])
store_items

         bikes  watches  pants  shoes  glasses  shirts  suits
store 1     10       50     30   13.0      NaN      22    NaN
store 2     15       60      7   22.0     10.0      22    NaN
store 3     11       11     11    NaN     11.0      11   11.0

In [82]:
store_items = store_items.append(new_store)
store_items

AttributeError: 'DataFrame' object has no attribute 'append'

### snippets

In [83]:
store_items["new watches"] = store_items["watches"][1:] + 10
store_items

         bikes  watches  pants  shoes  glasses  shirts  suits  new watches
store 1     10       50     30   13.0      NaN      22    NaN          NaN
store 2     15       60      7   22.0     10.0      22    NaN         70.0
store 3     11       11     11    NaN     11.0      11   11.0         21.0

## Future: append new columns of an existing dataframe to our data frame

In [84]:
new_columns = {"Tvs": [100,99,90], "Phones":[60,50,55]}
new_columns = pd.DataFrame(new_columns,index=["store 1","store 2", "store 3"])
new_columns

         Tvs  Phones
store 1  100      60
store 2   99      50
store 3   90      55

In [85]:
store_items = store_items.join(new_columns)
store_items

,bikes,watches,pants,shoes,glasses,shirts,suits,new watches,Tvs,Phones
store 1,10,50,30,13.0,NaN,22,NaN,NaN,100,60
store 2,15,60,7,22.0,10.0,22,NaN,70.0,99,50
store 3,11,11,11,NaN,11.0,11,11.0,21.0,90,55

## Boolean indexing 
- we can perform logical operations on the data frame and get a data series of booleans (the labels will be the same as the data frame labels, and the values will be True or False)
- we can use this data series to index the data frame and get the rows that satisfy the condition

In [99]:
store_items

,bikes,watches,pants,shoes,glasses,shirts,suits,new watches,Tvs,Phones
store 1,10,50,30,13.0,NaN,22,NaN,NaN,100,60
store 2,15,60,7,22.0,10.0,22,NaN,70.0,99,50
store 3,11,11,11,NaN,11.0,11,11.0,21.0,90,55

In [95]:
# get the store that has more than 10 bikes
mask = store_items["bikes"] > 10
mask, type(mask)

(store 1    False
 store 2     True
 store 3     True
 Name: bikes, dtype: bool,
 pandas.core.series.Series)

In [96]:
store_items[mask]

,bikes,watches,pants,shoes,glasses,shirts,suits,new watches,Tvs,Phones
store 2,15,60,7,22.0,10.0,22,NaN,70.0,99,50
store 3,11,11,11,NaN,11.0,11,11.0,21.0,90,55

- get the store that has nan values in any of its columns

In [107]:
mask = store_items.isnull().any(axis=1)
mask, type(mask)

(store 1    True
 store 2    True
 store 3    True
 dtype: bool,
 pandas.core.series.Series)

In [108]:
store_items[mask]

,bikes,watches,pants,shoes,glasses,shirts,suits,new watches,Tvs,Phones
store 1,10,50,30,13.0,NaN,22,NaN,NaN,100,60
store 2,15,60,7,22.0,10.0,22,NaN,70.0,99,50
store 3,11,11,11,NaN,11.0,11,11.0,21.0,90,55

## delete from the data frame 
- using `df.pop("column)` method to delete columns , call it pop a column!
    - and it works in place
- or using .drop() method to delete both rows and columns using axis
    - also works in place

In [84]:
store_items

,bikes,watches,pants,shoes,glasses,shirts,suits,new watches,Tvs,Phones
store 1,10,50,30,13.0,NaN,22,52,NaN,100,60
store 2,15,60,7,22.0,10.0,22,29,70.0,99,50
store 3,11,11,11,NaN,11.0,11,11,21.0,90,55

In [85]:
store_items.pop('new watches')

store 1     NaN
store 2    70.0
store 3    21.0
Name: new watches, dtype: float64

- we got the column that we popped out as a result of the method

In [86]:
store_items

         bikes  watches  pants  shoes  glasses  shirts  suits  Tvs  Phones
store 1     10       50     30   13.0      NaN      22     52  100      60
store 2     15       60      7   22.0     10.0      22     29   99      50
store 3     11       11     11    NaN     11.0      11     11   90      55

- to delete columns using drop, we have to specify the axis to be 1 
     - `df.drop("column" or ["column1", "column2"], axis=1)`

In [87]:
store_items = store_items.drop(["pants","shoes"], axis = 1)
store_items

         bikes  watches  glasses  shirts  suits  Tvs  Phones
store 1     10       50      NaN      22     52  100      60
store 2     15       60     10.0      22     29   99      50
store 3     11       11     11.0      11     11   90      55

- to delete rows using drop, we have to specify the axis to be 0 
     - `df.drop("row" or ["row1", "row2"], axis=0)`

In [88]:
store_items = store_items.drop(["store 1"], axis = 0)
store_items

         bikes  watches  glasses  shirts  suits  Tvs  Phones
store 2     15       60     10.0      22     29   99      50
store 3     11       11     11.0      11     11   90      55

In [89]:
store_items

         bikes  watches  glasses  shirts  suits  Tvs  Phones
store 2     15       60     10.0      22     29   99      50
store 3     11       11     11.0      11     11   90      55

## renaming the labels 
- using the `.rename(columns or index= {old label as key: new label as value})`
    - `columns` parameter if we will rename a column label
    - `index` parameter if we will rename a row label
- we can use columns attribute for column label change or index attribute for row label change

In [90]:
store_items

         bikes  watches  glasses  shirts  suits  Tvs  Phones
store 2     15       60     10.0      22     29   99      50
store 3     11       11     11.0      11     11   90      55

In [91]:
store_items = store_items.rename(columns={'suits':'outfits'})
store_items

         bikes  watches  glasses  shirts  outfits  Tvs  Phones
store 2     15       60     10.0      22       29   99      50
store 3     11       11     11.0      11       11   90      55

In [92]:
store_items = store_items.rename(index={'store 2':'store 1','store 3':'store 2'})
store_items

         bikes  watches  glasses  shirts  outfits  Tvs  Phones
store 1     15       60     10.0      22       29   99      50
store 2     11       11     11.0      11       11   90      55

we can use the values of a column as a row index labels :)

## dealing with Nan values 
- important before analyzing data or train a machine learning algorithm with it
- we first need to clean it (detect and correct errors)
- types of bad data 
 - outliers 
 - incorrect values
 - missing values (mostly)

In [93]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

##### in a large data set we can't visualize all Nan values

### counting the number of Nan values

In [94]:
store_items.isnull()

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1  False  False    False   False  False  False     True
store 2  False  False    False   False  False  False    False
store 3  False  False    False    True  False   True    False

- in pandas 
    - logical true has value 1
    - logical false has numerical value 0
- so we can get the Nans by counting the logical ones

- summing the Nans for each column

In [95]:
store_items.isnull().sum(axis=0)

bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64

- notice that when we work on the rows (axis = 0), we produce a result for each column
- also when we work on the columns (axis = 1), we produce a result for each row

In [96]:
store_items.isnull().sum(axis=1)

store 1    1
store 2    0
store 3    2
dtype: int64

to sum it all up

In [97]:
store_items.isnull().sum().sum()

3

if we used it again on the remaining column we will get the values for the whole data frame

### counting the number of non-Nan values

In [98]:
store_items.count()

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

## after detecting the Nan values we can
- remove them 
- replace them

### remove a Nan method
- using .dropna(axis)
 - if axis = 0, drop any row with a Nan value 
 - if axis = 1, drop any column with a Nan value 
- drop happens out of place
- to remove them in place, set the attribute inplace= True

In [99]:
store_items.dropna(axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [100]:
store_items.dropna(axis = 1)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

In [101]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

### replace a Nan method
- you can use `df.fillna()` to replace it with a value that we choose
    - also happens out of place
- we can use `fillna(number)` to replace all the Nans with a certain number
    - that number can be hardcoded like 0 or anything 
    - that number can also be the mean of each column `df.fillna(df.mean(), axis=0)` or anything else
- replace the NaNs with values of previous row or column
    - using `df.fillna(method="ffill", axis = 0 or 1)` (stands for forward filling)
    - use axis to decide a previous row or a previous column (to fill it horizontally or vertically)
- replace with values from the following row or column `df.fillna(method="ffill", axis = 0 or 1)`
    - same way but set the method= `backfill`
- replace Nans using different interpolations method with .interpolate()
    - using linear interpolation (with method="linear") using the values before it along the column or row (with axis = 0 or 1)

#### replace it with a value of our choise
- using `fillna(value)`

In [102]:
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

##### with the mean of each column

In [103]:
store_items.mean()

bikes      18.333333
pants      21.666667
watches    26.666667
shirts      8.500000
shoes       7.666667
suits      26.000000
glasses    27.000000
dtype: float64

In [104]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [105]:
store_items.fillna(store_items.mean(),axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     27.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     8.5     10   26.0      4.0

#### replace it with a value from previous row or column

In [106]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [107]:
store_items.fillna(method="ffill",axis = 0)

C:\Users\TOSHIBA\AppData\Local\Temp\ipykernel_13892\190670373.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  store_items.fillna(method="ffill",axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

- future tip: the above cell will be deprecated in the future, and we should isntead use df.ffill() or df.bfill() for forward and backward filling

In [108]:
store_items.ffill(axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

notice that the NaNs in the first row still a Nan (no previous row)

In [109]:
store_items.fillna(method="ffill",axis=1)

C:\Users\TOSHIBA\AppData\Local\Temp\ipykernel_13892\987170338.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  store_items.fillna(method="ffill",axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

#### backword filling

In [110]:
store_items.fillna(method="backfill",axis=0)

C:\Users\TOSHIBA\AppData\Local\Temp\ipykernel_13892\3026385950.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  store_items.fillna(method="backfill",axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [111]:
# alternatively 
store_items.bfill(axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [112]:
store_items.fillna(method="backfill",axis=1)

C:\Users\TOSHIBA\AppData\Local\Temp\ipykernel_13892\1034037513.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  store_items.fillna(method="backfill",axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0      NaN
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    10.0   10.0    4.0      4.0

- notice that the values of the last row or column are still Nans (no following row or column to fill them with)

#### replace using linear interpolation

In [113]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [114]:
store_items.interpolate(method="linear",axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [115]:
store_items.interpolate(method="linear",axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    22.5   10.0    7.0      4.0

- notice that what choice to be made regarding Nan values is problem and designer specific
    - we could have a problem where we need to delete the entire row or column if it has a Nan value
    - we could subsitiute it with a value of our choice say 0 or the mean of each column 
    - we could use forward or backward filling
    - and so on

Example

In [116]:
import pandas as pd
import numpy as np

# DO NOT CHANGE THE VARIABLE NAMES

# Set the precision of our dataframes to one decimal place.
#pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a series of books. 
# The ratings given are in the range from 1 to 5, with 5 being the best score. 
# The names of the books, the corresponding authors, and the ratings of each user are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

# User ratings are in the order of the book titles mentioned above
# If a user has not rated all books, Pandas will automatically consider the missing values as NaN.
# If a user has mentioned `np.nan` value, then also it means that the user has not yet rated that book.
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])


# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. 
# Let Pandas automatically assign numerical row indices to the DataFrame. 

# TO DO: Create a dictionary with the data given above
dat = {'Author':authors,'Book Title':books, 'User 1':user_1, 'User 2':user_2, 'User 3':user_3, 'User 4':user_4}

# TO DO: Create a Pandas DataFrame using the dictionary created above
book_ratings = pd.DataFrame(dat)
print(book_ratings)
# TO DO:
# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 
# 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4' 
# and row indices 0 through 4.

# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. 
# HINT: Use the `pandas.DataFrame.fillna(value, inplace = True)` function for substituting the NaN values. 
# Write your code below:
ratings_mean = book_ratings[["User 1", "User 2","User 3", "User 4"]].mean()
#print(ratings_mean)
book_ratings[["User 1", "User 2","User 3", "User 4"]] = book_ratings[["User 1", "User 2","User 3", "User 4"]].fillna(ratings_mean)
print(book_ratings)
# # to pick all the books that had a rating of 5
# book_ratings.isin([5]).any(axis=1)
# book_ratings[book_ratings.isin([5]).any(axis=1)]

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     NaN     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     NaN     4.0
3          H. G. Wells     The Time Machine     NaN     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     NaN     NaN     NaN     4.2
                Author           Book Title  User 1  User 2    User 3  User 4
0      Charles Dickens   Great Expectations    3.20   5.000  2.000000     4.0
1       John Steinbeck      Of Mice and Men    2.85   1.300  2.300000     3.5
2  William Shakespeare     Romeo and Juliet    2.50   4.000  2.766667     4.0
3          H. G. Wells     The Time Machine    2.85   3.800  4.000000     5.0
4        Lewis Carroll  Alice in Wonderland    2.85   3.525  2.766667     4.2

- my Tip: in the above code, we want to change a slice of the data frame, so we can't use in_place = True on the slice (i have used it and it gave me SettingWithCopyWarning: 
A value is trying to be set on a copy of a slice from a DataFrame)
    - so instead, we do `df slice = df slice changed`

In [117]:
book_ratings.loc[book_ratings.isin([5]).any(axis=1)]

            Author          Book Title  User 1  User 2  User 3  User 4
0  Charles Dickens  Great Expectations    3.20     5.0     2.0     4.0
3      H. G. Wells    The Time Machine    2.85     3.8     4.0     5.0

- mine
- notice that dataframes support in operator via `isin()` method
    - alternativelty we could use df == 5
- then we used the `any()` method to check if there is any True
    - and we used it with axis = 1 to check for any True in columns for each row
- then having a boolean series of the rows that have any True, we used it to index the dataframe directly via `df[boolean series]`
    - refer to the boolean indexing in dataframes

## loading data into a pandas Data Frame
- we will most likely use it
- pandas allowses to load data bases of different formats into data frames
 - one of the most popular formats is csv
- we can load a csv file into a dataframe using a read_csv() function

In [118]:
google_stock = pd.read_csv('Goog-1.csv')
google_stock

,Date,Open,High,Low,Close,Adj Close,Volume
0,2004-08-19,49.676899,51.693783,47.669952,49.845802,49.845802,44994500
1,2004-08-20,50.178635,54.187561,49.925285,53.805050,53.805050,23005800
2,2004-08-23,55.017166,56.373344,54.172661,54.346527,54.346527,18393200
3,2004-08-24,55.260582,55.439419,51.450363,52.096165,52.096165,15361800
4,2004-08-25,52.140873,53.651051,51.604362,52.657513,52.657513,9257400
...,...,...,...,...,...,...,...
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

- pandas assigned numerical row indicies to the data frame
- pandas also used the names in the first row of the csv file to assign column labels

### take a look at the first few rows
 - using .head(number of rows = 5)

In [119]:
google_stock.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

In [120]:
google_stock.loc[[0,1,2]]

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200

In [121]:
google_stock.iloc[[0,1,2]]

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200

### take a look at the last 5 rows
- .tail(number of rows = 5)

In [122]:
google_stock.tail(8)

,Date,Open,High,Low,Close,Adj Close,Volume
3305,2017-10-04,957.000000,960.390015,950.690002,951.679993,951.679993,952400
3306,2017-10-05,955.489990,970.909973,955.179993,969.960022,969.960022,1213800
3307,2017-10-06,966.700012,979.460022,963.359985,978.890015,978.890015,1173900
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

### check for Nan values

In [123]:
google_stock.isnull().sum(axis = 0)

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

In [124]:
# another way to check wither any of the columns contains Nan values
google_stock.isnull().any(axis = 0)

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

- axis = 0 (getting the result for every column) is the default value for the axis parameter so we can omit it,

In [125]:
google_stock.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

## get statistical information from the data set
- .describe() returns statistics on each column of the data set

In [126]:
google_stock.describe()

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

#### to get the statistics of a certain column

In [127]:
google_stock["Adj Close"].describe()

count    3313.000000
mean      380.072458
std       223.853780
min        49.681866
25%       226.407440
50%       293.029114
75%       536.690002
max       989.679993
Name: Adj Close, dtype: float64

- count: number of non-Nan values
- mean: average of the column
- std: standard deviation of the column
- then the 5 number summary (min, 25%, 50%, 75%, max), remember that we used that to describe the distribution of the numerical data to do many things 
    - like to detect outliers
    - to detect the skewness of the data (left or right or normal)

#### look up a certain statistic on the data set or a certain column

In [128]:
try:
    google_stock.mean()
except Exception as e:
    print(e)

Could not convert ['2004-08-192004-08-202004-08-232004-08-242004-08-252004-08-262004-08-272004-08-302004-08-312004-09-012004-09-022004-09-032004-09-072004-09-082004-09-092004-09-102004-09-132004-09-142004-09-152004-09-162004-09-172004-09-202004-09-212004-09-222004-09-232004-09-242004-09-272004-09-282004-09-292004-09-302004-10-012004-10-042004-10-052004-10-062004-10-072004-10-082004-10-112004-10-122004-10-132004-10-142004-10-152004-10-182004-10-192004-10-202004-10-212004-10-222004-10-252004-10-262004-10-272004-10-282004-10-292004-11-012004-11-022004-11-032004-11-042004-11-052004-11-082004-11-092004-11-102004-11-112004-11-122004-11-152004-11-162004-11-172004-11-182004-11-192004-11-222004-11-232004-11-242004-11-262004-11-292004-11-302004-12-012004-12-022004-12-032004-12-062004-12-072004-12-082004-12-092004-12-102004-12-132004-12-142004-12-152004-12-162004-12-172004-12-202004-12-212004-12-222004-12-232004-12-272004-12-282004-12-292004-12-302004-12-312005-01-032005-01-042005-01-052005-01-062005-01-072005-01-102005-01-112005-01-122005-01-132005-01-142005-01-182005-01-192005-01-202005-01-212005-01-242005-01-252005-01-262005-01-272005-01-282005-01-312005-02-012005-02-022005-02-032005-02-042005-02-072005-02-082005-02-092005-02-102005-02-112005-02-142005-02-152005-02-162005-02-172005-02-182005-02-222005-02-232005-02-242005-02-252005-02-282005-03-012005-03-022005-03-032005-03-042005-03-072005-03-082005-03-092005-03-102005-03-112005-03-142005-03-152005-03-162005-03-172005-03-182005-03-212005-03-222005-03-232005-03-242005-03-282005-03-292005-03-302005-03-312005-04-012005-04-042005-04-052005-04-062005-04-072005-04-082005-04-112005-04-122005-04-132005-04-142005-04-152005-04-182005-04-192005-04-202005-04-212005-04-222005-04-252005-04-262005-04-272005-04-282005-04-292005-05-022005-05-032005-05-042005-05-052005-05-062005-05-092005-05-102005-05-112005-05-122005-05-132005-05-162005-05-172005-05-182005-05-192005-05-202005-05-232005-05-242005-05-252005-05-262005-05-272005-05-312005-06-012005-06-022005-06-032005-06-062005-06-072005-06-082005-06-092005-06-102005-06-132005-06-142005-06-152005-06-162005-06-172005-06-202005-06-212005-06-222005-06-232005-06-242005-06-272005-06-282005-06-292005-06-302005-07-012005-07-052005-07-062005-07-072005-07-082005-07-112005-07-122005-07-132005-07-142005-07-152005-07-182005-07-192005-07-202005-07-212005-07-222005-07-252005-07-262005-07-272005-07-282005-07-292005-08-012005-08-022005-08-032005-08-042005-08-052005-08-082005-08-092005-08-102005-08-112005-08-122005-08-152005-08-162005-08-172005-08-182005-08-192005-08-222005-08-232005-08-242005-08-252005-08-262005-08-292005-08-302005-08-312005-09-012005-09-022005-09-062005-09-072005-09-082005-09-092005-09-122005-09-132005-09-142005-09-152005-09-162005-09-192005-09-202005-09-212005-09-222005-09-232005-09-262005-09-272005-09-282005-09-292005-09-302005-10-032005-10-042005-10-052005-10-062005-10-072005-10-102005-10-112005-10-122005-10-132005-10-142005-10-172005-10-182005-10-192005-10-202005-10-212005-10-242005-10-252005-10-262005-10-272005-10-282005-10-312005-11-012005-11-022005-11-032005-11-042005-11-072005-11-082005-11-092005-11-102005-11-112005-11-142005-11-152005-11-162005-11-172005-11-182005-11-212005-11-222005-11-232005-11-252005-11-282005-11-292005-11-302005-12-012005-12-022005-12-052005-12-062005-12-072005-12-082005-12-092005-12-122005-12-132005-12-142005-12-152005-12-162005-12-192005-12-202005-12-212005-12-222005-12-232005-12-272005-12-282005-12-292005-12-302006-01-032006-01-042006-01-052006-01-062006-01-092006-01-102006-01-112006-01-122006-01-132006-01-172006-01-182006-01-192006-01-202006-01-232006-01-242006-01-252006-01-262006-01-272006-01-302006-01-312006-02-012006-02-022006-02-032006-02-062006-02-072006-02-082006-02-092006-02-102006-02-132006-02-142006-02-152006-02-162006-02-172006-02-212006-02-222006-02-232006-02-242006-02-272006-02-282006-03-012006-03-022006-03-032006-03-062006-03-072006-03-082006-03-092006-03-102006-03-132006-03-142006-03-152006-03-162006-03-172006-03-202006-03-212006-03-222006-03-232006-03-242006-03-272006-03-282006-03-292006-03-302006-03-312006-04-032006-04-042006-04-052006-04-062006-04-072006-04-102006-04-112006-04-122006-04-132006-04-172006-04-182006-04-192006-04-202006-04-212006-04-242006-04-252006-04-262006-04-272006-04-282006-05-012006-05-022006-05-032006-05-042006-05-052006-05-082006-05-092006-05-102006-05-112006-05-122006-05-152006-05-162006-05-172006-05-182006-05-192006-05-222006-05-232006-05-242006-05-252006-05-262006-05-302006-05-312006-06-012006-06-022006-06-052006-06-062006-06-072006-06-082006-06-092006-06-122006-06-132006-06-142006-06-152006-06-162006-06-192006-06-202006-06-212006-06-222006-06-232006-06-262006-06-272006-06-282006-06-292006-06-302006-07-032006-07-052006-07-062006-07-072006-07-102006-07-112006-07-122006-07-132006-07-142006-07-172006-07-182006-07-192006-07-202006-07-212006-07-242006-07-252006-07-262006-07-272006-07-282006-07-312006-08-012006-08-022006-08-032006-08-042006-08-072006-08-082006-08-092006-08-102006-08-112006-08-142006-08-152006-08-162006-08-172006-08-182006-08-212006-08-222006-08-232006-08-242006-08-252006-08-282006-08-292006-08-302006-08-312006-09-012006-09-052006-09-062006-09-072006-09-082006-09-112006-09-122006-09-132006-09-142006-09-152006-09-182006-09-192006-09-202006-09-212006-09-222006-09-252006-09-262006-09-272006-09-282006-09-292006-10-022006-10-032006-10-042006-10-052006-10-062006-10-092006-10-102006-10-112006-10-122006-10-132006-10-162006-10-172006-10-182006-10-192006-10-202006-10-232006-10-242006-10-252006-10-262006-10-272006-10-302006-10-312006-11-012006-11-022006-11-032006-11-062006-11-072006-11-082006-11-092006-11-102006-11-132006-11-142006-11-152006-11-162006-11-172006-11-202006-11-212006-11-222006-11-242006-11-272006-11-282006-11-292006-11-302006-12-012006-12-042006-12-052006-12-062006-12-072006-12-082006-12-112006-12-122006-12-132006-12-142006-12-152006-12-182006-12-192006-12-202006-12-212006-12-222006-12-262006-12-272006-12-282006-12-292007-01-032007-01-042007-01-052007-01-082007-01-092007-01-102007-01-112007-01-122007-01-162007-01-172007-01-182007-01-192007-01-222007-01-232007-01-242007-01-252007-01-262007-01-292007-01-302007-01-312007-02-012007-02-022007-02-052007-02-062007-02-072007-02-082007-02-092007-02-122007-02-132007-02-142007-02-152007-02-162007-02-202007-02-212007-02-222007-02-232007-02-262007-02-272007-02-282007-03-012007-03-022007-03-052007-03-062007-03-072007-03-082007-03-092007-03-122007-03-132007-03-142007-03-152007-03-162007-03-192007-03-202007-03-212007-03-222007-03-232007-03-262007-03-272007-03-282007-03-292007-03-302007-04-022007-04-032007-04-042007-04-052007-04-092007-04-102007-04-112007-04-122007-04-132007-04-162007-04-172007-04-182007-04-192007-04-202007-04-232007-04-242007-04-252007-04-262007-04-272007-04-302007-05-012007-05-022007-05-032007-05-042007-05-072007-05-082007-05-092007-05-102007-05-112007-05-142007-05-152007-05-162007-05-172007-05-182007-05-212007-05-222007-05-232007-05-242007-05-252007-05-292007-05-302007-05-312007-06-012007-06-042007-06-052007-06-062007-06-072007-06-082007-06-112007-06-122007-06-132007-06-142007-06-152007-06-182007-06-192007-06-202007-06-212007-06-222007-06-252007-06-262007-06-272007-06-282007-06-292007-07-022007-07-032007-07-052007-07-062007-07-092007-07-102007-07-112007-07-122007-07-132007-07-162007-07-172007-07-182007-07-192007-07-202007-07-232007-07-242007-07-252007-07-262007-07-272007-07-302007-07-312007-08-012007-08-022007-08-032007-08-062007-08-072007-08-082007-08-092007-08-102007-08-132007-08-142007-08-152007-08-162007-08-172007-08-202007-08-212007-08-222007-08-232007-08-242007-08-272007-08-282007-08-292007-08-302007-08-312007-09-042007-09-052007-09-062007-09-072007-09-102007-09-112007-09-122007-09-132007-09-142007-09-172007-09-182007-09-192007-09-202007-09-212007-09-242007-09-252007-09-262007-09-272007-09-282007-10-012007-10-022007-10-032007-10-042007-10-052007-10-082007-10-092007-10-102007-10-112007-10-122007-10-152007-10-162007-10-172007-10-182007-10-192007-10-222007-10-232007-10-242007-10-252007-10-262007-10-292007-10-302007-10-312007-11-012007-11-022007-11-052007-11-062007-11-072007-11-082007-11-092007-11-122007-11-132007-11-142007-11-152007-11-162007-11-192007-11-202007-11-212007-11-232007-11-262007-11-272007-11-282007-11-292007-11-302007-12-032007-12-042007-12-052007-12-062007-12-072007-12-102007-12-112007-12-122007-12-132007-12-142007-12-172007-12-182007-12-192007-12-202007-12-212007-12-242007-12-262007-12-272007-12-282007-12-312008-01-022008-01-032008-01-042008-01-072008-01-082008-01-092008-01-102008-01-112008-01-142008-01-152008-01-162008-01-172008-01-182008-01-222008-01-232008-01-242008-01-252008-01-282008-01-292008-01-302008-01-312008-02-012008-02-042008-02-052008-02-062008-02-072008-02-082008-02-112008-02-122008-02-132008-02-142008-02-152008-02-192008-02-202008-02-212008-02-222008-02-252008-02-262008-02-272008-02-282008-02-292008-03-032008-03-042008-03-052008-03-062008-03-072008-03-102008-03-112008-03-122008-03-132008-03-142008-03-172008-03-182008-03-192008-03-202008-03-242008-03-252008-03-262008-03-272008-03-282008-03-312008-04-012008-04-022008-04-032008-04-042008-04-072008-04-082008-04-092008-04-102008-04-112008-04-142008-04-152008-04-162008-04-172008-04-182008-04-212008-04-222008-04-232008-04-242008-04-252008-04-282008-04-292008-04-302008-05-012008-05-022008-05-052008-05-062008-05-072008-05-082008-05-092008-05-122008-05-132008-05-142008-05-152008-05-162008-05-192008-05-202008-05-212008-05-222008-05-232008-05-272008-05-282008-05-292008-05-302008-06-022008-06-032008-06-042008-06-052008-06-062008-06-092008-06-102008-06-112008-06-122008-06-132008-06-162008-06-172008-06-182008-06-192008-06-202008-06-232008-06-242008-06-252008-06-262008-06-272008-06-302008-07-012008-07-022008-07-032008-07-072008-07-082008-07-092008-07-102008-07-112008-07-142008-07-152008-07-162008-07-172008-07-182008-07-212008-07-222008-07-232008-07-242008-07-252008-07-282008-07-292008-07-302008-07-312008-08-012008-08-042008-08-052008-08-062008-08-072008-08-082008-08-112008-08-122008-08-132008-08-142008-08-152008-08-182008-08-192008-08-202008-08-212008-08-222008-08-252008-08-262008-08-272008-08-282008-08-292008-09-022008-09-032008-09-042008-09-052008-09-082008-09-092008-09-102008-09-112008-09-122008-09-152008-09-162008-09-172008-09-182008-09-192008-09-222008-09-232008-09-242008-09-252008-09-262008-09-292008-09-302008-10-012008-10-022008-10-032008-10-062008-10-072008-10-082008-10-092008-10-102008-10-132008-10-142008-10-152008-10-162008-10-172008-10-202008-10-212008-10-222008-10-232008-10-242008-10-272008-10-282008-10-292008-10-302008-10-312008-11-032008-11-042008-11-052008-11-062008-11-072008-11-102008-11-112008-11-122008-11-132008-11-142008-11-172008-11-182008-11-192008-11-202008-11-212008-11-242008-11-252008-11-262008-11-282008-12-012008-12-022008-12-032008-12-042008-12-052008-12-082008-12-092008-12-102008-12-112008-12-122008-12-152008-12-162008-12-172008-12-182008-12-192008-12-222008-12-232008-12-242008-12-262008-12-292008-12-302008-12-312009-01-022009-01-052009-01-062009-01-072009-01-082009-01-092009-01-122009-01-132009-01-142009-01-152009-01-162009-01-202009-01-212009-01-222009-01-232009-01-262009-01-272009-01-282009-01-292009-01-302009-02-022009-02-032009-02-042009-02-052009-02-062009-02-092009-02-102009-02-112009-02-122009-02-132009-02-172009-02-182009-02-192009-02-202009-02-232009-02-242009-02-252009-02-262009-02-272009-03-022009-03-032009-03-042009-03-052009-03-062009-03-092009-03-102009-03-112009-03-122009-03-132009-03-162009-03-172009-03-182009-03-192009-03-202009-03-232009-03-242009-03-252009-03-262009-03-272009-03-302009-03-312009-04-012009-04-022009-04-032009-04-062009-04-072009-04-082009-04-092009-04-132009-04-142009-04-152009-04-162009-04-172009-04-202009-04-212009-04-222009-04-232009-04-242009-04-272009-04-282009-04-292009-04-302009-05-012009-05-042009-05-052009-05-062009-05-072009-05-082009-05-112009-05-122009-05-132009-05-142009-05-152009-05-182009-05-192009-05-202009-05-212009-05-222009-05-262009-05-272009-05-282009-05-292009-06-012009-06-022009-06-032009-06-042009-06-052009-06-082009-06-092009-06-102009-06-112009-06-122009-06-152009-06-162009-06-172009-06-182009-06-192009-06-222009-06-232009-06-242009-06-252009-06-262009-06-292009-06-302009-07-012009-07-022009-07-062009-07-072009-07-082009-07-092009-07-102009-07-132009-07-142009-07-152009-07-162009-07-172009-07-202009-07-212009-07-222009-07-232009-07-242009-07-272009-07-282009-07-292009-07-302009-07-312009-08-032009-08-042009-08-052009-08-062009-08-072009-08-102009-08-112009-08-122009-08-132009-08-142009-08-172009-08-182009-08-192009-08-202009-08-212009-08-242009-08-252009-08-262009-08-272009-08-282009-08-312009-09-012009-09-022009-09-032009-09-042009-09-082009-09-092009-09-102009-09-112009-09-142009-09-152009-09-162009-09-172009-09-182009-09-212009-09-222009-09-232009-09-242009-09-252009-09-282009-09-292009-09-302009-10-012009-10-022009-10-052009-10-062009-10-072009-10-082009-10-092009-10-122009-10-132009-10-142009-10-152009-10-162009-10-192009-10-202009-10-212009-10-222009-10-232009-10-262009-10-272009-10-282009-10-292009-10-302009-11-022009-11-032009-11-042009-11-052009-11-062009-11-092009-11-102009-11-112009-11-122009-11-132009-11-162009-11-172009-11-182009-11-192009-11-202009-11-232009-11-242009-11-252009-11-272009-11-302009-12-012009-12-022009-12-032009-12-042009-12-072009-12-082009-12-092009-12-102009-12-112009-12-142009-12-152009-12-162009-12-172009-12-182009-12-212009-12-222009-12-232009-12-242009-12-282009-12-292009-12-302009-12-312010-01-042010-01-052010-01-062010-01-072010-01-082010-01-112010-01-122010-01-132010-01-142010-01-152010-01-192010-01-202010-01-212010-01-222010-01-252010-01-262010-01-272010-01-282010-01-292010-02-012010-02-022010-02-032010-02-042010-02-052010-02-082010-02-092010-02-102010-02-112010-02-122010-02-162010-02-172010-02-182010-02-192010-02-222010-02-232010-02-242010-02-252010-02-262010-03-012010-03-022010-03-032010-03-042010-03-052010-03-082010-03-092010-03-102010-03-112010-03-122010-03-152010-03-162010-03-172010-03-182010-03-192010-03-222010-03-232010-03-242010-03-252010-03-262010-03-292010-03-302010-03-312010-04-012010-04-052010-04-062010-04-072010-04-082010-04-092010-04-122010-04-132010-04-142010-04-152010-04-162010-04-192010-04-202010-04-212010-04-222010-04-232010-04-262010-04-272010-04-282010-04-292010-04-302010-05-032010-05-042010-05-052010-05-062010-05-072010-05-102010-05-112010-05-122010-05-132010-05-142010-05-172010-05-182010-05-192010-05-202010-05-212010-05-242010-05-252010-05-262010-05-272010-05-282010-06-012010-06-022010-06-032010-06-042010-06-072010-06-082010-06-092010-06-102010-06-112010-06-142010-06-152010-06-162010-06-172010-06-182010-06-212010-06-222010-06-232010-06-242010-06-252010-06-282010-06-292010-06-302010-07-012010-07-022010-07-062010-07-072010-07-082010-07-092010-07-122010-07-132010-07-142010-07-152010-07-162010-07-192010-07-202010-07-212010-07-222010-07-232010-07-262010-07-272010-07-282010-07-292010-07-302010-08-022010-08-032010-08-042010-08-052010-08-062010-08-092010-08-102010-08-112010-08-122010-08-132010-08-162010-08-172010-08-182010-08-192010-08-202010-08-232010-08-242010-08-252010-08-262010-08-272010-08-302010-08-312010-09-012010-09-022010-09-032010-09-072010-09-082010-09-092010-09-102010-09-132010-09-142010-09-152010-09-162010-09-172010-09-202010-09-212010-09-222010-09-232010-09-242010-09-272010-09-282010-09-292010-09-302010-10-012010-10-042010-10-052010-10-062010-10-072010-10-082010-10-112010-10-122010-10-132010-10-142010-10-152010-10-182010-10-192010-10-202010-10-212010-10-222010-10-252010-10-262010-10-272010-10-282010-10-292010-11-012010-11-022010-11-032010-11-042010-11-052010-11-082010-11-092010-11-102010-11-112010-11-122010-11-152010-11-162010-11-172010-11-182010-11-192010-11-222010-11-232010-11-242010-11-262010-11-292010-11-302010-12-012010-12-022010-12-032010-12-062010-12-072010-12-082010-12-092010-12-102010-12-132010-12-142010-12-152010-12-162010-12-172010-12-202010-12-212010-12-222010-12-232010-12-272010-12-282010-12-292010-12-302010-12-312011-01-032011-01-042011-01-052011-01-062011-01-072011-01-102011-01-112011-01-122011-01-132011-01-142011-01-182011-01-192011-01-202011-01-212011-01-242011-01-252011-01-262011-01-272011-01-282011-01-312011-02-012011-02-022011-02-032011-02-042011-02-072011-02-082011-02-092011-02-102011-02-112011-02-142011-02-152011-02-162011-02-172011-02-182011-02-222011-02-232011-02-242011-02-252011-02-282011-03-012011-03-022011-03-032011-03-042011-03-072011-03-082011-03-092011-03-102011-03-112011-03-142011-03-152011-03-162011-03-172011-03-182011-03-212011-03-222011-03-232011-03-242011-03-252011-03-282011-03-292011-03-302011-03-312011-04-012011-04-042011-04-052011-04-062011-04-072011-04-082011-04-112011-04-122011-04-132011-04-142011-04-152011-04-182011-04-192011-04-202011-04-212011-04-252011-04-262011-04-272011-04-282011-04-292011-05-022011-05-032011-05-042011-05-052011-05-062011-05-092011-05-102011-05-112011-05-122011-05-132011-05-162011-05-172011-05-182011-05-192011-05-202011-05-232011-05-242011-05-252011-05-262011-05-272011-05-312011-06-012011-06-022011-06-032011-06-062011-06-072011-06-082011-06-092011-06-102011-06-132011-06-142011-06-152011-06-162011-06-172011-06-202011-06-212011-06-222011-06-232011-06-242011-06-272011-06-282011-06-292011-06-302011-07-012011-07-052011-07-062011-07-072011-07-082011-07-112011-07-122011-07-132011-07-142011-07-152011-07-182011-07-192011-07-202011-07-212011-07-222011-07-252011-07-262011-07-272011-07-282011-07-292011-08-012011-08-022011-08-032011-08-042011-08-052011-08-082011-08-092011-08-102011-08-112011-08-122011-08-152011-08-162011-08-172011-08-182011-08-192011-08-222011-08-232011-08-242011-08-252011-08-262011-08-292011-08-302011-08-312011-09-012011-09-022011-09-062011-09-072011-09-082011-09-092011-09-122011-09-132011-09-142011-09-152011-09-162011-09-192011-09-202011-09-212011-09-222011-09-232011-09-262011-09-272011-09-282011-09-292011-09-302011-10-032011-10-042011-10-052011-10-062011-10-072011-10-102011-10-112011-10-122011-10-132011-10-142011-10-172011-10-182011-10-192011-10-202011-10-212011-10-242011-10-252011-10-262011-10-272011-10-282011-10-312011-11-012011-11-022011-11-032011-11-042011-11-072011-11-082011-11-092011-11-102011-11-112011-11-142011-11-152011-11-162011-11-172011-11-182011-11-212011-11-222011-11-232011-11-252011-11-282011-11-292011-11-302011-12-012011-12-022011-12-052011-12-062011-12-072011-12-082011-12-092011-12-122011-12-132011-12-142011-12-152011-12-162011-12-192011-12-202011-12-212011-12-222011-12-232011-12-272011-12-282011-12-292011-12-302012-01-032012-01-042012-01-052012-01-062012-01-092012-01-102012-01-112012-01-122012-01-132012-01-172012-01-182012-01-192012-01-202012-01-232012-01-242012-01-252012-01-262012-01-272012-01-302012-01-312012-02-012012-02-022012-02-032012-02-062012-02-072012-02-082012-02-092012-02-102012-02-132012-02-142012-02-152012-02-162012-02-172012-02-212012-02-222012-02-232012-02-242012-02-272012-02-282012-02-292012-03-012012-03-022012-03-052012-03-062012-03-072012-03-082012-03-092012-03-122012-03-132012-03-142012-03-152012-03-162012-03-192012-03-202012-03-212012-03-222012-03-232012-03-262012-03-272012-03-282012-03-292012-03-302012-04-022012-04-032012-04-042012-04-052012-04-092012-04-102012-04-112012-04-122012-04-132012-04-162012-04-172012-04-182012-04-192012-04-202012-04-232012-04-242012-04-252012-04-262012-04-272012-04-302012-05-012012-05-022012-05-032012-05-042012-05-072012-05-082012-05-092012-05-102012-05-112012-05-142012-05-152012-05-162012-05-172012-05-182012-05-212012-05-222012-05-232012-05-242012-05-252012-05-292012-05-302012-05-312012-06-012012-06-042012-06-052012-06-062012-06-072012-06-082012-06-112012-06-122012-06-132012-06-142012-06-152012-06-182012-06-192012-06-202012-06-212012-06-222012-06-252012-06-262012-06-272012-06-282012-06-292012-07-022012-07-032012-07-052012-07-062012-07-092012-07-102012-07-112012-07-122012-07-132012-07-162012-07-172012-07-182012-07-192012-07-202012-07-232012-07-24

- the above raised an error because of the date column, it's not a numerical column so we can't get the statistics of it
    - so we can select the columns that we want to get the statistics of for all the rows via `df[['column1', 'column2']].describe()` or `df.iloc[:, [column indicies,]].describe()`

In [129]:
google_stock[["Open","High"]].mean()

Open    380.186092
High    383.493740
dtype: float64

In [130]:
google_stock.iloc[:,[1,3]].mean()

Open    380.186092
Low     376.519309
dtype: float64

In [131]:
google_stock.iloc[:,1:].mean()

Open         3.801861e+02
High         3.834937e+02
Low          3.765193e+02
Close        3.800725e+02
Adj Close    3.800725e+02
Volume       8.038476e+06
dtype: float64

In [132]:
google_stock["Adj Close"].min()

49.681866

### get the correlation between different columns

In [133]:
google_stock.iloc[:,1:].corr()

               Open      High       Low     Close  Adj Close    Volume
Open       1.000000  0.999904  0.999845  0.999745   0.999745 -0.564258
High       0.999904  1.000000  0.999834  0.999868   0.999868 -0.562749
Low        0.999845  0.999834  1.000000  0.999899   0.999899 -0.567007
Close      0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Adj Close  0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Volume    -0.564258 -0.562749 -0.567007 -0.564967  -0.564967  1.000000

## group data to get different types of information
- using .groupby()

In [134]:
data = pd.read_csv("fake-company.csv")
data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

In [135]:
# How much money the company spent on salaries each year?
data.groupby(['Year'])["Salary"].sum() # when we use group by, we have to specify what to do with the grouped values (either sum them or get their average or whatever depending on the application)

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [136]:
# To know the average salary for each year
data.groupby(['Year'])["Salary"].mean()

Year
1990    51000.0
1991    54000.0
1992    58000.0
Name: Salary, dtype: float64

In [137]:
# How much in total each employee got paid?
data.groupby(["Name"])["Salary"].sum()

Name
Alice      50000
Bob        48000
Charlie    55000
Dakota     52000
Elsa       50000
Frank      60000
Grace      60000
Hoffman    52000
Inaar      62000
Name: Salary, dtype: int64

In [138]:
data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

In [139]:
# what is the salary distribution per department 
data.groupby(["Department"])["Salary"].sum()

Department
Admin    237000
HR       102000
RD       150000
Name: Salary, dtype: int64

but since some departments have records for variant -different- number of years, we need to get the average to describe it better

In [140]:
# what is the salary distribution per department 
data.groupby(["Department"])["Salary"].mean()

Department
Admin    59250.0
HR       51000.0
RD       50000.0
Name: Salary, dtype: float64

In [141]:
# what is the salary distribution per department per year
data.groupby(["Department","Year"])["Salary"].sum()

Department  Year
Admin       1990     55000
            1991     60000
            1992    122000
HR          1990     50000
            1991     52000
RD          1990     48000
            1991     50000
            1992     52000
Name: Salary, dtype: int64

Recommended Practice
We recommend you practice the examples available at the 10 minutes to pandas as a conclusive tutorial.
https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html